###################################################################

# Created by write_sdc on Sun Mar 4 18:24:23 2018

###################################################################
set sdc_version 2.0

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 1 [get_ports done]
set_load -pin_load 1 [get_ports {quotient[31]}]
set_load -pin_load 1 [get_ports {quotient[30]}]
set_load -pin_load 1 [get_ports {quotient[29]}]
set_load -pin_load 1 [get_ports {quotient[28]}]
set_load -pin_load 1 [get_ports {quotient[27]}]
set_load -pin_load 1 [get_ports {quotient[26]}]
set_load -pin_load 1 [get_ports {quotient[25]}]
set_load -pin_load 1 [get_ports {quotient[24]}]
set_load -pin_load 1 [get_ports {quotient[23]}]
set_load -pin_load 1 [get_ports {quotient[22]}]
set_load -pin_load 1 [get_ports {quotient[21]}]
set_load -pin_load 1 [get_ports {quotient[20]}]
set_load -pin_load 1 [get_ports {quotient[19]}]
set_load -pin_load 1 [get_ports {quotient[18]}]
set_load -pin_load 1 [get_ports {quotient[17]}]
set_load -pin_load 1 [get_ports {quotient[16]}]
set_load -pin_load 1 [get_ports {quotient[15]}]
set_load -pin_load 1 [get_ports {quotient[14]}]
set_load -pin_load 1 [get_ports {quotient[13]}]
set_load -pin_load 1 [get_ports {quotient[12]}]
set_load -pin_load 1 [get_ports {quotient[11]}]
set_load -pin_load 1 [get_ports {quotient[10]}]
set_load -pin_load 1 [get_ports {quotient[9]}]
set_load -pin_load 1 [get_ports {quotient[8]}]
set_load -pin_load 1 [get_ports {quotient[7]}]
set_load -pin_load 1 [get_ports {quotient[6]}]
set_load -pin_load 1 [get_ports {quotient[5]}]
set_load -pin_load 1 [get_ports {quotient[4]}]
set_load -pin_load 1 [get_ports {quotient[3]}]
set_load -pin_load 1 [get_ports {quotient[2]}]
set_load -pin_load 1 [get_ports {quotient[1]}]
set_load -pin_load 1 [get_ports {quotient[0]}]
set_load -pin_load 1 [get_ports {remainder[31]}]
set_load -pin_load 1 [get_ports {remainder[30]}]
set_load -pin_load 1 [get_ports {remainder[29]}]
set_load -pin_load 1 [get_ports {remainder[28]}]
set_load -pin_load 1 [get_ports {remainder[27]}]
set_load -pin_load 1 [get_ports {remainder[26]}]
set_load -pin_load 1 [get_ports {remainder[25]}]
set_load -pin_load 1 [get_ports {remainder[24]}]
set_load -pin_load 1 [get_ports {remainder[23]}]
set_load -pin_load 1 [get_ports {remainder[22]}]
set_load -pin_load 1 [get_ports {remainder[21]}]
set_load -pin_load 1 [get_ports {remainder[20]}]
set_load -pin_load 1 [get_ports {remainder[19]}]
set_load -pin_load 1 [get_ports {remainder[18]}]
set_load -pin_load 1 [get_ports {remainder[17]}]
set_load -pin_load 1 [get_ports {remainder[16]}]
set_load -pin_load 1 [get_ports {remainder[15]}]
set_load -pin_load 1 [get_ports {remainder[14]}]
set_load -pin_load 1 [get_ports {remainder[13]}]
set_load -pin_load 1 [get_ports {remainder[12]}]
set_load -pin_load 1 [get_ports {remainder[11]}]
set_load -pin_load 1 [get_ports {remainder[10]}]
set_load -pin_load 1 [get_ports {remainder[9]}]
set_load -pin_load 1 [get_ports {remainder[8]}]
set_load -pin_load 1 [get_ports {remainder[7]}]
set_load -pin_load 1 [get_ports {remainder[6]}]
set_load -pin_load 1 [get_ports {remainder[5]}]
set_load -pin_load 1 [get_ports {remainder[4]}]
set_load -pin_load 1 [get_ports {remainder[3]}]
set_load -pin_load 1 [get_ports {remainder[2]}]
set_load -pin_load 1 [get_ports {remainder[1]}]
set_load -pin_load 1 [get_ports {remainder[0]}]
create_clock [get_ports clk]  -period 5  -waveform {0 2.5}
group_path -name FEEDTHROUGH  -from [list [get_ports rst] [get_ports start] [get_ports {dividend[31]}] [get_ports {dividend[30]}] [get_ports {dividend[29]}] [get_ports {dividend[28]}] [get_ports {dividend[27]}] [get_ports {dividend[26]}] [get_ports {dividend[25]}] [get_ports {dividend[24]}] [get_ports {dividend[23]}] [get_ports {dividend[22]}] [get_ports {dividend[21]}] [get_ports {dividend[20]}] [get_ports {dividend[19]}] [get_ports {dividend[18]}] [get_ports {dividend[17]}] [get_ports {dividend[16]}] [get_ports {dividend[15]}] [get_ports {dividend[14]}] [get_ports {dividend[13]}] [get_ports {dividend[12]}] [get_ports {dividend[11]}] [get_ports {dividend[10]}] [get_ports {dividend[9]}] [get_ports {dividend[8]}] [get_ports {dividend[7]}] [get_ports {dividend[6]}] [get_ports {dividend[5]}] [get_ports {dividend[4]}] [get_ports {dividend[3]}] [get_ports {dividend[2]}] [get_ports {dividend[1]}] [get_ports {dividend[0]}] [get_ports {divisor[31]}] [get_ports {divisor[30]}] [get_ports {divisor[29]}] [get_ports {divisor[28]}] [get_ports {divisor[27]}] [get_ports {divisor[26]}] [get_ports {divisor[25]}] [get_ports {divisor[24]}] [get_ports {divisor[23]}] [get_ports {divisor[22]}] [get_ports {divisor[21]}] [get_ports {divisor[20]}] [get_ports {divisor[19]}] [get_ports {divisor[18]}] [get_ports {divisor[17]}] [get_ports {divisor[16]}] [get_ports {divisor[15]}] [get_ports {divisor[14]}] [get_ports {divisor[13]}] [get_ports {divisor[12]}] [get_ports {divisor[11]}] [get_ports {divisor[10]}] [get_ports {divisor[9]}] [get_ports {divisor[8]}] [get_ports {divisor[7]}] [get_ports {divisor[6]}] [get_ports {divisor[5]}] [get_ports {divisor[4]}] [get_ports {divisor[3]}] [get_ports {divisor[2]}] [get_ports {divisor[1]}] [get_ports {divisor[0]}]]  -to [list [get_ports done] [get_ports {quotient[31]}] [get_ports {quotient[30]}] [get_ports {quotient[29]}] [get_ports {quotient[28]}] [get_ports {quotient[27]}] [get_ports {quotient[26]}] [get_ports {quotient[25]}] [get_ports {quotient[24]}] [get_ports {quotient[23]}] [get_ports {quotient[22]}] [get_ports {quotient[21]}] [get_ports {quotient[20]}] [get_ports {quotient[19]}] [get_ports {quotient[18]}] [get_ports {quotient[17]}] [get_ports {quotient[16]}] [get_ports {quotient[15]}] [get_ports {quotient[14]}] [get_ports {quotient[13]}] [get_ports {quotient[12]}] [get_ports {quotient[11]}] [get_ports {quotient[10]}] [get_ports {quotient[9]}] [get_ports {quotient[8]}] [get_ports {quotient[7]}] [get_ports {quotient[6]}] [get_ports {quotient[5]}] [get_ports {quotient[4]}] [get_ports {quotient[3]}] [get_ports {quotient[2]}] [get_ports {quotient[1]}] [get_ports {quotient[0]}] [get_ports {remainder[31]}] [get_ports {remainder[30]}] [get_ports {remainder[29]}] [get_ports {remainder[28]}] [get_ports {remainder[27]}] [get_ports {remainder[26]}] [get_ports {remainder[25]}] [get_ports {remainder[24]}] [get_ports {remainder[23]}] [get_ports {remainder[22]}] [get_ports {remainder[21]}] [get_ports {remainder[20]}] [get_ports {remainder[19]}] [get_ports {remainder[18]}] [get_ports {remainder[17]}] [get_ports {remainder[16]}] [get_ports {remainder[15]}] [get_ports {remainder[14]}] [get_ports {remainder[13]}] [get_ports {remainder[12]}] [get_ports {remainder[11]}] [get_ports {remainder[10]}] [get_ports {remainder[9]}] [get_ports {remainder[8]}] [get_ports {remainder[7]}] [get_ports {remainder[6]}] [get_ports {remainder[5]}] [get_ports {remainder[4]}] [get_ports {remainder[3]}] [get_ports {remainder[2]}] [get_ports {remainder[1]}] [get_ports {remainder[0]}]]
group_path -name REGIN  -from [list [get_ports rst] [get_ports start] [get_ports {dividend[31]}] [get_ports {dividend[30]}] [get_ports {dividend[29]}] [get_ports {dividend[28]}] [get_ports {dividend[27]}] [get_ports {dividend[26]}] [get_ports {dividend[25]}] [get_ports {dividend[24]}] [get_ports {dividend[23]}] [get_ports {dividend[22]}] [get_ports {dividend[21]}] [get_ports {dividend[20]}] [get_ports {dividend[19]}] [get_ports {dividend[18]}] [get_ports {dividend[17]}] [get_ports {dividend[16]}] [get_ports {dividend[15]}] [get_ports {dividend[14]}] [get_ports {dividend[13]}] [get_ports {dividend[12]}] [get_ports {dividend[11]}] [get_ports {dividend[10]}] [get_ports {dividend[9]}] [get_ports {dividend[8]}] [get_ports {dividend[7]}] [get_ports {dividend[6]}] [get_ports {dividend[5]}] [get_ports {dividend[4]}] [get_ports {dividend[3]}] [get_ports {dividend[2]}] [get_ports {dividend[1]}] [get_ports {dividend[0]}] [get_ports {divisor[31]}] [get_ports {divisor[30]}] [get_ports {divisor[29]}] [get_ports {divisor[28]}] [get_ports {divisor[27]}] [get_ports {divisor[26]}] [get_ports {divisor[25]}] [get_ports {divisor[24]}] [get_ports {divisor[23]}] [get_ports {divisor[22]}] [get_ports {divisor[21]}] [get_ports {divisor[20]}] [get_ports {divisor[19]}] [get_ports {divisor[18]}] [get_ports {divisor[17]}] [get_ports {divisor[16]}] [get_ports {divisor[15]}] [get_ports {divisor[14]}] [get_ports {divisor[13]}] [get_ports {divisor[12]}] [get_ports {divisor[11]}] [get_ports {divisor[10]}] [get_ports {divisor[9]}] [get_ports {divisor[8]}] [get_ports {divisor[7]}] [get_ports {divisor[6]}] [get_ports {divisor[5]}] [get_ports {divisor[4]}] [get_ports {divisor[3]}] [get_ports {divisor[2]}] [get_ports {divisor[1]}] [get_ports {divisor[0]}]]
group_path -name REGOUT  -to [list [get_ports done] [get_ports {quotient[31]}] [get_ports {quotient[30]}] [get_ports {quotient[29]}] [get_ports {quotient[28]}] [get_ports {quotient[27]}] [get_ports {quotient[26]}] [get_ports {quotient[25]}] [get_ports {quotient[24]}] [get_ports {quotient[23]}] [get_ports {quotient[22]}] [get_ports {quotient[21]}] [get_ports {quotient[20]}] [get_ports {quotient[19]}] [get_ports {quotient[18]}] [get_ports {quotient[17]}] [get_ports {quotient[16]}] [get_ports {quotient[15]}] [get_ports {quotient[14]}] [get_ports {quotient[13]}] [get_ports {quotient[12]}] [get_ports {quotient[11]}] [get_ports {quotient[10]}] [get_ports {quotient[9]}] [get_ports {quotient[8]}] [get_ports {quotient[7]}] [get_ports {quotient[6]}] [get_ports {quotient[5]}] [get_ports {quotient[4]}] [get_ports {quotient[3]}] [get_ports {quotient[2]}] [get_ports {quotient[1]}] [get_ports {quotient[0]}] [get_ports {remainder[31]}] [get_ports {remainder[30]}] [get_ports {remainder[29]}] [get_ports {remainder[28]}] [get_ports {remainder[27]}] [get_ports {remainder[26]}] [get_ports {remainder[25]}] [get_ports {remainder[24]}] [get_ports {remainder[23]}] [get_ports {remainder[22]}] [get_ports {remainder[21]}] [get_ports {remainder[20]}] [get_ports {remainder[19]}] [get_ports {remainder[18]}] [get_ports {remainder[17]}] [get_ports {remainder[16]}] [get_ports {remainder[15]}] [get_ports {remainder[14]}] [get_ports {remainder[13]}] [get_ports {remainder[12]}] [get_ports {remainder[11]}] [get_ports {remainder[10]}] [get_ports {remainder[9]}] [get_ports {remainder[8]}] [get_ports {remainder[7]}] [get_ports {remainder[6]}] [get_ports {remainder[5]}] [get_ports {remainder[4]}] [get_ports {remainder[3]}] [get_ports {remainder[2]}] [get_ports {remainder[1]}] [get_ports {remainder[0]}]]
set_input_delay -clock clk  -max 1  [get_ports rst]
set_input_delay -clock clk  -max 1  [get_ports start]
set_input_delay -clock clk  -max 1  [get_ports {dividend[31]}]
set_input_delay -clock clk  -max 1  [get_ports {dividend[30]}]
set_input_delay -clock clk  -max 1  [get_ports {dividend[29]}]
set_input_delay -clock clk  -max 1  [get_ports {dividend[28]}]
set_input_delay -clock clk  -max 1  [get_ports {dividend[27]}]
set_input_delay -clock clk  -max 1  [get_ports {dividend[26]}]
set_input_delay -clock clk  -max 1  [get_ports {dividend[25]}]
set_input_delay -clock clk  -max 1  [get_ports {dividend[24]}]
set_input_delay -clock clk  -max 1  [get_ports {dividend[23]}]
set_input_delay -clock clk  -max 1  [get_ports {dividend[22]}]
set_input_delay -clock clk  -max 1  [get_ports {dividend[21]}]
set_input_delay -clock clk  -max 1  [get_ports {dividend[20]}]
set_input_delay -clock clk  -max 1  [get_ports {dividend[19]}]
set_input_delay -clock clk  -max 1  [get_ports {dividend[18]}]
set_input_delay -clock clk  -max 1  [get_ports {dividend[17]}]
set_input_delay -clock clk  -max 1  [get_ports {dividend[16]}]
set_input_delay -clock clk  -max 1  [get_ports {dividend[15]}]
set_input_delay -clock clk  -max 1  [get_ports {dividend[14]}]
set_input_delay -clock clk  -max 1  [get_ports {dividend[13]}]
set_input_delay -clock clk  -max 1  [get_ports {dividend[12]}]
set_input_delay -clock clk  -max 1  [get_ports {dividend[11]}]
set_input_delay -clock clk  -max 1  [get_ports {dividend[10]}]
set_input_delay -clock clk  -max 1  [get_ports {dividend[9]}]
set_input_delay -clock clk  -max 1  [get_ports {dividend[8]}]
set_input_delay -clock clk  -max 1  [get_ports {dividend[7]}]
set_input_delay -clock clk  -max 1  [get_ports {dividend[6]}]
set_input_delay -clock clk  -max 1  [get_ports {dividend[5]}]
set_input_delay -clock clk  -max 1  [get_ports {dividend[4]}]
set_input_delay -clock clk  -max 1  [get_ports {dividend[3]}]
set_input_delay -clock clk  -max 1  [get_ports {dividend[2]}]
set_input_delay -clock clk  -max 1  [get_ports {dividend[1]}]
set_input_delay -clock clk  -max 1  [get_ports {dividend[0]}]
set_input_delay -clock clk  -max 1  [get_ports {divisor[31]}]
set_input_delay -clock clk  -max 1  [get_ports {divisor[30]}]
set_input_delay -clock clk  -max 1  [get_ports {divisor[29]}]
set_input_delay -clock clk  -max 1  [get_ports {divisor[28]}]
set_input_delay -clock clk  -max 1  [get_ports {divisor[27]}]
set_input_delay -clock clk  -max 1  [get_ports {divisor[26]}]
set_input_delay -clock clk  -max 1  [get_ports {divisor[25]}]
set_input_delay -clock clk  -max 1  [get_ports {divisor[24]}]
set_input_delay -clock clk  -max 1  [get_ports {divisor[23]}]
set_input_delay -clock clk  -max 1  [get_ports {divisor[22]}]
set_input_delay -clock clk  -max 1  [get_ports {divisor[21]}]
set_input_delay -clock clk  -max 1  [get_ports {divisor[20]}]
set_input_delay -clock clk  -max 1  [get_ports {divisor[19]}]
set_input_delay -clock clk  -max 1  [get_ports {divisor[18]}]
set_input_delay -clock clk  -max 1  [get_ports {divisor[17]}]
set_input_delay -clock clk  -max 1  [get_ports {divisor[16]}]
set_input_delay -clock clk  -max 1  [get_ports {divisor[15]}]
set_input_delay -clock clk  -max 1  [get_ports {divisor[14]}]
set_input_delay -clock clk  -max 1  [get_ports {divisor[13]}]
set_input_delay -clock clk  -max 1  [get_ports {divisor[12]}]
set_input_delay -clock clk  -max 1  [get_ports {divisor[11]}]
set_input_delay -clock clk  -max 1  [get_ports {divisor[10]}]
set_input_delay -clock clk  -max 1  [get_ports {divisor[9]}]
set_input_delay -clock clk  -max 1  [get_ports {divisor[8]}]
set_input_delay -clock clk  -max 1  [get_ports {divisor[7]}]
set_input_delay -clock clk  -max 1  [get_ports {divisor[6]}]
set_input_delay -clock clk  -max 1  [get_ports {divisor[5]}]
set_input_delay -clock clk  -max 1  [get_ports {divisor[4]}]
set_input_delay -clock clk  -max 1  [get_ports {divisor[3]}]
set_input_delay -clock clk  -max 1  [get_ports {divisor[2]}]
set_input_delay -clock clk  -max 1  [get_ports {divisor[1]}]
set_input_delay -clock clk  -max 1  [get_ports {divisor[0]}]
set_output_delay -clock clk  -max 1  [get_ports done]
set_output_delay -clock clk  -max 1  [get_ports {quotient[31]}]
set_output_delay -clock clk  -max 1  [get_ports {quotient[30]}]
set_output_delay -clock clk  -max 1  [get_ports {quotient[29]}]
set_output_delay -clock clk  -max 1  [get_ports {quotient[28]}]
set_output_delay -clock clk  -max 1  [get_ports {quotient[27]}]
set_output_delay -clock clk  -max 1  [get_ports {quotient[26]}]
set_output_delay -clock clk  -max 1  [get_ports {quotient[25]}]
set_output_delay -clock clk  -max 1  [get_ports {quotient[24]}]
set_output_delay -clock clk  -max 1  [get_ports {quotient[23]}]
set_output_delay -clock clk  -max 1  [get_ports {quotient[22]}]
set_output_delay -clock clk  -max 1  [get_ports {quotient[21]}]
set_output_delay -clock clk  -max 1  [get_ports {quotient[20]}]
set_output_delay -clock clk  -max 1  [get_ports {quotient[19]}]
set_output_delay -clock clk  -max 1  [get_ports {quotient[18]}]
set_output_delay -clock clk  -max 1  [get_ports {quotient[17]}]
set_output_delay -clock clk  -max 1  [get_ports {quotient[16]}]
set_output_delay -clock clk  -max 1  [get_ports {quotient[15]}]
set_output_delay -clock clk  -max 1  [get_ports {quotient[14]}]
set_output_delay -clock clk  -max 1  [get_ports {quotient[13]}]
set_output_delay -clock clk  -max 1  [get_ports {quotient[12]}]
set_output_delay -clock clk  -max 1  [get_ports {quotient[11]}]
set_output_delay -clock clk  -max 1  [get_ports {quotient[10]}]
set_output_delay -clock clk  -max 1  [get_ports {quotient[9]}]
set_output_delay -clock clk  -max 1  [get_ports {quotient[8]}]
set_output_delay -clock clk  -max 1  [get_ports {quotient[7]}]
set_output_delay -clock clk  -max 1  [get_ports {quotient[6]}]
set_output_delay -clock clk  -max 1  [get_ports {quotient[5]}]
set_output_delay -clock clk  -max 1  [get_ports {quotient[4]}]
set_output_delay -clock clk  -max 1  [get_ports {quotient[3]}]
set_output_delay -clock clk  -max 1  [get_ports {quotient[2]}]
set_output_delay -clock clk  -max 1  [get_ports {quotient[1]}]
set_output_delay -clock clk  -max 1  [get_ports {quotient[0]}]
set_output_delay -clock clk  -max 1  [get_ports {remainder[31]}]
set_output_delay -clock clk  -max 1  [get_ports {remainder[30]}]
set_output_delay -clock clk  -max 1  [get_ports {remainder[29]}]
set_output_delay -clock clk  -max 1  [get_ports {remainder[28]}]
set_output_delay -clock clk  -max 1  [get_ports {remainder[27]}]
set_output_delay -clock clk  -max 1  [get_ports {remainder[26]}]
set_output_delay -clock clk  -max 1  [get_ports {remainder[25]}]
set_output_delay -clock clk  -max 1  [get_ports {remainder[24]}]
set_output_delay -clock clk  -max 1  [get_ports {remainder[23]}]
set_output_delay -clock clk  -max 1  [get_ports {remainder[22]}]
set_output_delay -clock clk  -max 1  [get_ports {remainder[21]}]
set_output_delay -clock clk  -max 1  [get_ports {remainder[20]}]
set_output_delay -clock clk  -max 1  [get_ports {remainder[19]}]
set_output_delay -clock clk  -max 1  [get_ports {remainder[18]}]
set_output_delay -clock clk  -max 1  [get_ports {remainder[17]}]
set_output_delay -clock clk  -max 1  [get_ports {remainder[16]}]
set_output_delay -clock clk  -max 1  [get_ports {remainder[15]}]
set_output_delay -clock clk  -max 1  [get_ports {remainder[14]}]
set_output_delay -clock clk  -max 1  [get_ports {remainder[13]}]
set_output_delay -clock clk  -max 1  [get_ports {remainder[12]}]
set_output_delay -clock clk  -max 1  [get_ports {remainder[11]}]
set_output_delay -clock clk  -max 1  [get_ports {remainder[10]}]
set_output_delay -clock clk  -max 1  [get_ports {remainder[9]}]
set_output_delay -clock clk  -max 1  [get_ports {remainder[8]}]
set_output_delay -clock clk  -max 1  [get_ports {remainder[7]}]
set_output_delay -clock clk  -max 1  [get_ports {remainder[6]}]
set_output_delay -clock clk  -max 1  [get_ports {remainder[5]}]
set_output_delay -clock clk  -max 1  [get_ports {remainder[4]}]
set_output_delay -clock clk  -max 1  [get_ports {remainder[3]}]
set_output_delay -clock clk  -max 1  [get_ports {remainder[2]}]
set_output_delay -clock clk  -max 1  [get_ports {remainder[1]}]
set_output_delay -clock clk  -max 1  [get_ports {remainder[0]}]
set_input_transition -max 0.1  [get_ports rst]
set_input_transition -min 0.1  [get_ports rst]
set_input_transition -max 0.1  [get_ports start]
set_input_transition -min 0.1  [get_ports start]
set_input_transition -max 0.1  [get_ports {dividend[31]}]
set_input_transition -min 0.1  [get_ports {dividend[31]}]
set_input_transition -max 0.1  [get_ports {dividend[30]}]
set_input_transition -min 0.1  [get_ports {dividend[30]}]
set_input_transition -max 0.1  [get_ports {dividend[29]}]
set_input_transition -min 0.1  [get_ports {dividend[29]}]
set_input_transition -max 0.1  [get_ports {dividend[28]}]
set_input_transition -min 0.1  [get_ports {dividend[28]}]
set_input_transition -max 0.1  [get_ports {dividend[27]}]
set_input_transition -min 0.1  [get_ports {dividend[27]}]
set_input_transition -max 0.1  [get_ports {dividend[26]}]
set_input_transition -min 0.1  [get_ports {dividend[26]}]
set_input_transition -max 0.1  [get_ports {dividend[25]}]
set_input_transition -min 0.1  [get_ports {dividend[25]}]
set_input_transition -max 0.1  [get_ports {dividend[24]}]
set_input_transition -min 0.1  [get_ports {dividend[24]}]
set_input_transition -max 0.1  [get_ports {dividend[23]}]
set_input_transition -min 0.1  [get_ports {dividend[23]}]
set_input_transition -max 0.1  [get_ports {dividend[22]}]
set_input_transition -min 0.1  [get_ports {dividend[22]}]
set_input_transition -max 0.1  [get_ports {dividend[21]}]
set_input_transition -min 0.1  [get_ports {dividend[21]}]
set_input_transition -max 0.1  [get_ports {dividend[20]}]
set_input_transition -min 0.1  [get_ports {dividend[20]}]
set_input_transition -max 0.1  [get_ports {dividend[19]}]
set_input_transition -min 0.1  [get_ports {dividend[19]}]
set_input_transition -max 0.1  [get_ports {dividend[18]}]
set_input_transition -min 0.1  [get_ports {dividend[18]}]
set_input_transition -max 0.1  [get_ports {dividend[17]}]
set_input_transition -min 0.1  [get_ports {dividend[17]}]
set_input_transition -max 0.1  [get_ports {dividend[16]}]
set_input_transition -min 0.1  [get_ports {dividend[16]}]
set_input_transition -max 0.1  [get_ports {dividend[15]}]
set_input_transition -min 0.1  [get_ports {dividend[15]}]
set_input_transition -max 0.1  [get_ports {dividend[14]}]
set_input_transition -min 0.1  [get_ports {dividend[14]}]
set_input_transition -max 0.1  [get_ports {dividend[13]}]
set_input_transition -min 0.1  [get_ports {dividend[13]}]
set_input_transition -max 0.1  [get_ports {dividend[12]}]
set_input_transition -min 0.1  [get_ports {dividend[12]}]
set_input_transition -max 0.1  [get_ports {dividend[11]}]
set_input_transition -min 0.1  [get_ports {dividend[11]}]
set_input_transition -max 0.1  [get_ports {dividend[10]}]
set_input_transition -min 0.1  [get_ports {dividend[10]}]
set_input_transition -max 0.1  [get_ports {dividend[9]}]
set_input_transition -min 0.1  [get_ports {dividend[9]}]
set_input_transition -max 0.1  [get_ports {dividend[8]}]
set_input_transition -min 0.1  [get_ports {dividend[8]}]
set_input_transition -max 0.1  [get_ports {dividend[7]}]
set_input_transition -min 0.1  [get_ports {dividend[7]}]
set_input_transition -max 0.1  [get_ports {dividend[6]}]
set_input_transition -min 0.1  [get_ports {dividend[6]}]
set_input_transition -max 0.1  [get_ports {dividend[5]}]
set_input_transition -min 0.1  [get_ports {dividend[5]}]
set_input_transition -max 0.1  [get_ports {dividend[4]}]
set_input_transition -min 0.1  [get_ports {dividend[4]}]
set_input_transition -max 0.1  [get_ports {dividend[3]}]
set_input_transition -min 0.1  [get_ports {dividend[3]}]
set_input_transition -max 0.1  [get_ports {dividend[2]}]
set_input_transition -min 0.1  [get_ports {dividend[2]}]
set_input_transition -max 0.1  [get_ports {dividend[1]}]
set_input_transition -min 0.1  [get_ports {dividend[1]}]
set_input_transition -max 0.1  [get_ports {dividend[0]}]
set_input_transition -min 0.1  [get_ports {dividend[0]}]
set_input_transition -max 0.1  [get_ports {divisor[31]}]
set_input_transition -min 0.1  [get_ports {divisor[31]}]
set_input_transition -max 0.1  [get_ports {divisor[30]}]
set_input_transition -min 0.1  [get_ports {divisor[30]}]
set_input_transition -max 0.1  [get_ports {divisor[29]}]
set_input_transition -min 0.1  [get_ports {divisor[29]}]
set_input_transition -max 0.1  [get_ports {divisor[28]}]
set_input_transition -min 0.1  [get_ports {divisor[28]}]
set_input_transition -max 0.1  [get_ports {divisor[27]}]
set_input_transition -min 0.1  [get_ports {divisor[27]}]
set_input_transition -max 0.1  [get_ports {divisor[26]}]
set_input_transition -min 0.1  [get_ports {divisor[26]}]
set_input_transition -max 0.1  [get_ports {divisor[25]}]
set_input_transition -min 0.1  [get_ports {divisor[25]}]
set_input_transition -max 0.1  [get_ports {divisor[24]}]
set_input_transition -min 0.1  [get_ports {divisor[24]}]
set_input_transition -max 0.1  [get_ports {divisor[23]}]
set_input_transition -min 0.1  [get_ports {divisor[23]}]
set_input_transition -max 0.1  [get_ports {divisor[22]}]
set_input_transition -min 0.1  [get_ports {divisor[22]}]
set_input_transition -max 0.1  [get_ports {divisor[21]}]
set_input_transition -min 0.1  [get_ports {divisor[21]}]
set_input_transition -max 0.1  [get_ports {divisor[20]}]
set_input_transition -min 0.1  [get_ports {divisor[20]}]
set_input_transition -max 0.1  [get_ports {divisor[19]}]
set_input_transition -min 0.1  [get_ports {divisor[19]}]
set_input_transition -max 0.1  [get_ports {divisor[18]}]
set_input_transition -min 0.1  [get_ports {divisor[18]}]
set_input_transition -max 0.1  [get_ports {divisor[17]}]
set_input_transition -min 0.1  [get_ports {divisor[17]}]
set_input_transition -max 0.1  [get_ports {divisor[16]}]
set_input_transition -min 0.1  [get_ports {divisor[16]}]
set_input_transition -max 0.1  [get_ports {divisor[15]}]
set_input_transition -min 0.1  [get_ports {divisor[15]}]
set_input_transition -max 0.1  [get_ports {divisor[14]}]
set_input_transition -min 0.1  [get_ports {divisor[14]}]
set_input_transition -max 0.1  [get_ports {divisor[13]}]
set_input_transition -min 0.1  [get_ports {divisor[13]}]
set_input_transition -max 0.1  [get_ports {divisor[12]}]
set_input_transition -min 0.1  [get_ports {divisor[12]}]
set_input_transition -max 0.1  [get_ports {divisor[11]}]
set_input_transition -min 0.1  [get_ports {divisor[11]}]
set_input_transition -max 0.1  [get_ports {divisor[10]}]
set_input_transition -min 0.1  [get_ports {divisor[10]}]
set_input_transition -max 0.1  [get_ports {divisor[9]}]
set_input_transition -min 0.1  [get_ports {divisor[9]}]
set_input_transition -max 0.1  [get_ports {divisor[8]}]
set_input_transition -min 0.1  [get_ports {divisor[8]}]
set_input_transition -max 0.1  [get_ports {divisor[7]}]
set_input_transition -min 0.1  [get_ports {divisor[7]}]
set_input_transition -max 0.1  [get_ports {divisor[6]}]
set_input_transition -min 0.1  [get_ports {divisor[6]}]
set_input_transition -max 0.1  [get_ports {divisor[5]}]
set_input_transition -min 0.1  [get_ports {divisor[5]}]
set_input_transition -max 0.1  [get_ports {divisor[4]}]
set_input_transition -min 0.1  [get_ports {divisor[4]}]
set_input_transition -max 0.1  [get_ports {divisor[3]}]
set_input_transition -min 0.1  [get_ports {divisor[3]}]
set_input_transition -max 0.1  [get_ports {divisor[2]}]
set_input_transition -min 0.1  [get_ports {divisor[2]}]
set_input_transition -max 0.1  [get_ports {divisor[1]}]
set_input_transition -min 0.1  [get_ports {divisor[1]}]
set_input_transition -max 0.1  [get_ports {divisor[0]}]
set_input_transition -min 0.1  [get_ports {divisor[0]}]
